kanban_backend/app/controllers/api/boards_controller.rb

    def show
      columns = Board.find(params[:id]).columns
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", "f149fd62-4cc7-47e2-ba71-bd636d9e636f"], ["LIMIT", 1]]
SELECT "columns".* FROM "columns" WHERE "columns"."board_id" = $1 ORDER BY "columns"."id" ASC LIMIT $2  [["board_id", "0d645282-d96b-549b-b95a-08a680302cd4"], ["LIMIT", 1]]

    def create
      board = Board.new(board_params)
      if board.save
---
INSERT INTO "boards" ("id", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["id", "9b2b3e10-c84c-495b-83e0-69a0ac6a8265"], ["title", "Канбан доска"], ["created_at", "2021-02-13 13:21:50.167368"], ["updated_at", "2021-02-13 13:21:50.167368"]]