kanban_backend/app/controllers/api/cards_controller.rb

SELECT "cards".* FROM "cards" WHERE "cards"."column_id" = $1  [["column_id", 271442091]]
---
    def index
      board = Board.find(params[:board_id])
      cards = Card.where(column_id: board.column_ids)

INSERT INTO "cards" ("column_id", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["column_id", 271442091], ["title", "Refactor"], ["created_at", "2021-02-14 11:42:59.733461"], ["updated_at", "2021-02-14 11:42:59.733461"]]
---
    def create
      card = Card.new(card_params)
      board = Board.find(params[:board_id])
      if card.save

UPDATE "cards" SET "column_id" = $1, "title" = $2, "updated_at" = $3 WHERE "cards"."id" = $4  [["column_id", 851722603], ["title", "Refactor"], ["updated_at", "2021-02-14 13:52:42.039538"], ["id", 160382063]]
---
    def update
      card = Card.find(params[:id])
      board = Board.find(params[:board_id])
      if card.update(column_id: params[:column_id])

DELETE FROM "cards" WHERE "cards"."id" = $1  [["id", 160382063]]
---
    def destroy
      card = Card.find(params[:id])
      board = Board.find(params[:board_id])
      if card.destroy

SELECT "columns".* FROM "columns" WHERE "columns"."id" = $1 LIMIT $2  [["id", 851722603], ["LIMIT", 1]]
---
    def set_column
      @column = Column.find(params[:column_id])

SELECT "cards".* FROM "cards" WHERE "cards"."column_id" = $1 AND "cards"."id" = $2 LIMIT $3  [["column_id", 851722603], ["id", 160382063], ["LIMIT", 1]]
---
    def set_column_card
      @card = @column.cards.find_by!(id: params[:id]) if @column