kanban_backend/app/controllers/api/columns_controller.rb

    def index
      columns = Board.find(params[:board_id]).columns
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", "0d645282-d96b-549b-b95a-08a680302cd4"], ["LIMIT", 1]]
SELECT "columns".* FROM "columns" WHERE "columns"."board_id" = $1  [["board_id", "0d645282-d96b-549b-b95a-08a680302cd4"]]

    def create
      column = Column.new(column_params)
      board = Board.find(column_params[:board_id])
      if column.save
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", "0d645282-d96b-549b-b95a-08a680302cd4"], ["LIMIT", 1]]
INSERT INTO "columns" ("board_id", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["board_id", "0d645282-d96b-549b-b95a-08a680302cd4"], ["title", "In process"], ["created_at", "2021-02-14 09:38:55.314752"], ["updated_at", "2021-02-14 09:38:55.314752"]]

    def destroy
      column = Column.find(params[:id])
      board = Board.find(column_params[:board_id])
      if column.destroy
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", "0d645282-d96b-549b-b95a-08a680302cd4"], ["LIMIT", 1]]
DELETE FROM "columns" WHERE "columns"."id" = $1  [["id", 271442091]]

    def set_board
      @board = Board.find(params[:board_id])
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", "0d645282-d96b-549b-b95a-08a680302cd4"], ["LIMIT", 1]]

    def set_board_column
      @column = @board.columns.find_by!(id: params[:id]) if @board
---
SELECT "columns".* FROM "columns" WHERE "columns"."board_id" = $1 AND "columns"."id" = $2 LIMIT $3  [["board_id", "0d645282-d96b-549b-b95a-08a680302cd4"], ["id", 271442091], ["LIMIT", 1]]